Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetRebarUpdateCurvesData
Gets a class that contains information used as input and output for rebar free form calculation.
Returns:
Gets a class that contains information used as input and output for rebar free form calculation.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.CreateEndConstraint(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
targetReferences:
The references to which the rebar handle will be constrained.
Will throw exception if it's empty or if it's anything but Face(s) from a structural that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns true if a start constraint can be created with the given references, false otherwise.
The reference should be faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.CreateStartConstraint(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
targetReferences:
The references to which the rebar handle will be constrained.
Will throw exception if it's empty or if it's anything but Face(s) from a structural that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns true if a start constraint can be created with the given references, false otherwise.
The reference should be faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetNumberOfBarGeometry
Gets the number of Bar Geometry that were added.
Returns:
Returns the number of Bar Geometry that were added.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.CanAddBarGeometry
Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.AddBarGeometry(Autodesk.Revit.DB.CurveLoop)
Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function can fail due to following reasons:
CurveLoop is empty.
CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.AddBarGeometry(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function will can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.ClearAllAddedBarGeometry
This function will remove all bars geometry that were added by calling AddBarGeometry().
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetAddedBarGeometry(System.Int32)
Gets the added curves that will represent the bar at index barIndex.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() - 1.
Returns:
Returns the curves that will represent the bar at index barIndex. The hooks plane normals will be applied on these curves.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBarGeometry()-1 ].
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarTrimExtendData
The class that contains the information needed to calculate and return the curves in a trimmed/extended state, and also find the constraints that trim/extend it.
Remarks:
If new curves will be added by calling addBarGeometry(), the existing curves in Rebar element will be replaced with these curves. It will not add curves to the existing ones.
Since:
2018